id: 54b355e7-1736-425e-8627-4972161b135a
name: AzureHound activity detected
description: Microsoft Graph queries sent to the tenant contained the User Agent string of AzureHound. This is a high fedility indicator that someone scans your Azure AD tenant for additional information and might be part of the inital phase of an attack.
severity: Medium
kind: NRT
version: 1.0.0
query: |-
  MicrosoftGraphActivityLogs
  | where UserAgent has "azurehound"
  | summarize QueriesSent=count() by UserId, IPAddress, ServicePrincipalId, AppId, TokenIssuedAt, Location, SignInActivityId, SourceSystem, AadTenantId, UserAgent
  | extend ConfidenceScore = 1
  | extend RemediationSteps = "Identify the identity and device used for this activity and confirm this is not a security test. If you can rule out a security test initiate the  incident response process to decide if the attacker can be evicted or should be observed"
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: AadUserId
    columnName: UserId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: Selected
    groupByEntities:
    - Account
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
alertDetailsOverride:
  alertDynamicProperties:
  - alertProperty: RemediationSteps
    value: RemediationSteps
  - alertProperty: ConfidenceScore
    value: ConfidenceScore
tactics:
  - Reconnaissance
  - Discovery
techniques:
  - T1087
  - T1087.004
  - T1069
  - T1069.003
  - T1595
  - T1595.002
  - T1589
suppressionEnabled: false
suppressionDuration: PT5H
