id: 1919c832-b23f-46bb-a110-e275b546dc78
name: Unusual sensitive action performed by Azure AD Connect account
description: The Azure AD Connect account is performing different sensitive actions that must not be done by this account. This is a sign of compromise for this accounts and should result in immediate action.
severity: High
kind: Scheduled
version: 1.0.0
queryFrequency: PT30M
queryPeriod: PT30M
triggerOperator: GreaterThan
triggerThreshold: 0
tactics:
  - LateralMovement
  - Persistence
  - PrivilegeEscalation
techniques:
  - T1550
  - T1550.001
  - T1098
  - T1098.001
  - T1078
  - T1078.004
query: |-
  let SensitiveActions = dynamic(["Update service principal","Add service principal credentials","Add owner to service principal","Add delegated permission grant"]);
  AuditLogs
  | extend InitiatedByUPN = parse_json(tostring(InitiatedBy.user)).userPrincipalName
  | where InitiatedByUPN startswith "Sync_" and InitiatedByUPN endswith "onmicrosoft.com"
  | where OperationName in~ (SensitiveActions)
  | mv-expand TargetResources
  | where TargetResources.type == "ServicePrincipal"
  | extend TargetResourcesname = TargetResources.name
  | extend TargetResourcesId = TargetResources.id
  | extend InitiatedByIpAddress = parse_json(tostring(InitiatedBy.user)).ipAddress
entityMappings:
  - entityType: Account
    fieldMappings:
      - columnName: InitiatedByUPN
        identifier: FullName
  - entityType: CloudApplication
    fieldMappings:
      - columnName: TargetResourcesId
        identifier: AppId
  - entityType: IP
    fieldMappings:
      - columnName: InitiatedByIpAddress
        identifier: Address
  - entityType: CloudApplication
    fieldMappings:
      - columnName: TargetResourcesname
        identifier: Name
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    matchingMethod: Selected
    reopenClosedIncident: false
    groupByCustomDetails: []
    groupByEntities:
      - Account
    groupByAlertDetails: []
    lookbackDuration: PT1H
    enabled: true
eventGroupingSettings:
  aggregationKind: AlertPerResult
customDetails:
  Activity: OperationName
suppressionEnabled: false
suppressionDuration: PT5H
